# 0.
# 实现简易计算器功能, 如图
# a = int(input("请输入第一个数:"))
# b = int(input("请输入第二个数:"))
# c = input("请输入需要做的运算符(+ - * /):")
# if c == '+' or c == '':
#     print('结果为:', end='')
#     print(a + b)
# if c == '-':
#     print('结果为:', end='')
#     print(a - b)
# if c == '*':
#     print('结果为:', end='')
#     print(a * b)
# if c == '/':
#     print('结果为:', end='')
#     print(a / b)


# 1.
# 让用户输入两个任意的整数, 比较两个数的大小, 输出最大的数
# a, b = int(input('请输入第一个数:')), int(input('请输入第二个数:'))
# if a > b:
#     print('较大的数为:', end='')
#     print(a)
# else:
#     print('较大的数为:', end='')
#     print(b)

# 2.
# 用户输入一个数, 打印出奇数还是偶数
# while True:
#     a = input("请输入一个数:")
#     if a == 'q':
#         print('退出')
#         break
#     if int(a) % 2 == 0:
#         print('此数为偶数.')
#     if int(a) % 2 != 0:
#         print('此数为奇数.')

# 3.
# 用户输入帐号密码, 帐号为admin, 密码为8888显示登录成功, 其余的显示登录失败
# while True:
#     account_number = input('请输入账号:')
#     pass_word = input('请输入密码:')
#     if account_number == 'admin' and pass_word == '8888':
#         print('登陆成功')
#         break
#     else:
#         print('登陆失败')

# 4.
# 用户输入一个数, 输出结果是否为水仙花数(水仙花数: 水仙花数是指一个
# 位数，它的每个位上的数字的
# 3
# 次幂之和等于它本身（例如：1 ^ 3 + 5 ^ 3 + 3 ^ 3 = 153）。)
# number = input('请输入一个数:')
# sum = 0
# for i in range(len(number)):
#      sum += int(number[i]) ** 3
# if number == sum:
#     print('是水仙花数')
# else:
#     print('不是水仙花数')


# 5.
# 用户输入年份, 输出结果是闰年还是平年(闰年: 1.
# 能整除4且不能整除100
# 2.
# 能整除400)
# year = int(input('输入年份:'))
# if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
#     print('闰年')
# else:
#     print('平年')


# 6.
# 输入公交卡当前的余额, 空座位数，只要超过2元，就可以上公交车;
# 没钱, 撵走；如果空座位的数量大于0，就可以坐下;
# 7.
# 成绩等级:
# 90
# 分以上: 等级为A
#
# 80 - 90: 等级为B
#
# 60 - 80: 等级C
#
# 0 - 60: 等级为D
#
# 8.
# 场景应用: 上火车(用户输入表示是否有票, 是否有刀具)
# 是否有票, 有票打印可以进站;
# 进站查看是否带有刀具, 有刀具, 没收上车, 没有刀具, 直接上车
# 没票打印不可以进站
#
# 9.
# 女友的节日:
# 定义holiday_name字符串变量记录节日名称
# 如果是
# 情人节
# 应该
# 买玫瑰／看电影
# 如果是
# 平安夜
# 应该
# 买苹果／吃大餐
# 如果是
# 生日
# 应该
# 买蛋糕
# 其他的时候, 每天都是节日
# 10.
# 英雄联盟(LOL)
# 李青技能:
# q, Q: 天音波
# w, W: 金钟罩 / 铁布衫
# e, E: 天雷破 / 摧筋断骨
# r, R: 猛龙摆尾
#
# 11.
# 用户决定是否发工资, 工资数是多少, 信用卡欠款;
# 有剩余的时候, 显示剩余金额(图1)
#
# 12.
# 让用户输入三个任意的整数, 比较三个数的大小, 输出最大的数
# a, b, c = int(input('请输入第一个数:')), int(input('请输入第二个数:')), int(input('请输入第三个数:'))
# if a > b > c or a > c > b:
#     print('最大值为%s' %(a))
# if b > c > a or b > a > c:
#     print('最大值为%s' %(b))
# if c > a > b or c > b > a:
#     print('最大值为%s' %(c))

