# 1. 计算从1到1000以内所有能被3或者17整除的数的和并输出
# sum = 0
# for i in list(range(1, 1001)):
#     if i % 3 == 0 or i % 17 == 0:
#         sum += i
# print(sum)


# 2. 求1到10的阶乘 (格式为 5的阶乘为: 120 )
# 	5: 5 * 4 * 3 * 2 * 1
# 	4: 4 * 3 * 2 * 1
# 	3: 3 * 2 * 1
# 	2: 2 * 1
# 	1: 1
# 	结果:
# 	5的阶乘为: 120
# 	4的阶乘为: 120
# 	3的阶乘为: 120
# 	2的阶乘为: 120
# 	1的阶乘为: 120
# product = 1
# a = []
# for i in range(1, 11):
#     product *= i
#     print('%s的阶乘为:%s'%(i, product))
#     i = str(i)
#     a.append(i)
#     b = '*'.join(a)
#     print('{}:{}'.format(b, product))

# 3. 求一到十阶乘之和。(1: 1 2: 2  3: 6  4: 24 5: 120)
# product = 1
# sum = 0
# a = []
# for i in range(1, 11):
#     product *= i
#     sum += product
#     print('%s的阶乘为:%s'%(i, product))
#     i = str(i)
#     a.append(i)
#     b = '*'.join(a)
#     print('{}:{}'.format(b, product))
# print(sum)


# 4. 功能：用户登录(三次机会尝试)
# 用户名密码：
# name = "aaa"
# password = "123"
# 让用户输入，如果输入正确，显示登录成功， 失败，显示还有几次机会， 超过三次失败，显示失去登录机会，明天再来。退出程序。
# 5. 打印出所有的“水仙花数”。
# 所谓“水仙花数”是指一个三位数，其各位数字立方和等于该数本身。例如：153是一个“水仙花数”，因为153=1的三次方+5的三次方+3的三次方。
# for i in range(100, 1000):
#     sum = 0
#     # i 转化为字符串
#     i = str(i)
#     for j in range(len(i)):
#         sum += int(i[j]) ** 3
#     # 需要将i转化为整形
#     if int(i) == sum:
#         print(i)

# 6.五位数中，对称的数称为回文数，打印所有的回文数并计算个数。如:12321
#
# 7.公园里有一只猴子和一堆桃子，猴子每天吃掉桃子总数的一半，把剩下一半中扔掉一个坏的。到第七天的时候，猴子睁开眼发现只剩下一个桃子。问公园里刚开始有多少个桃子？
# def f(n):
#     # 设置一个初始值
#     if n == 7:
#         return 1
#     # 列出算法
#     return (f(n + 1) + 1) * 2
# b = f(1)
# print(b)